public class variable_001 {
    public static void main(String[] args) {
        int a;
        int b;
        int sum;
        a = 3;
        b = 4;

        sum = a + b;
        System.out.println(sum);

        sum = a + b + a;
        System.out.println(sum);
    }
}

/*

[1]: 변수란 무엇인가? --> 바구니다. --> 데이터를 저장하는 메모리 공간이다. --> 변하는 수.

[2]: 변수 선언이란 무엇인가? --> 변수를 사용하기 위해서는 먼저 변수의 타입에 맞는 선언을 해줘야 한다.
     정수형의 변수를 사용하고자 한다면 --> 먼저 정수형 타입의 자료형을 선언해주고 사용해야 한다. --> 데이터타입(자료형)

[3]: 변수의 용도는 무엇인가? --> 저장 --> 어떤 연산을 수행할 때 값들을 저장해놓아야 하는데 그 때 변수(바구니)를 활용한다.

[4]: 변수는 왜 필요한가? -->


 */